<?php
namespace Adminko;

class Shingles
{
	const SHINGLES_COUNT = 5;

	protected static $stop_words = array(
		'а', 'ax', 'б', 'без', 'более', 'бы', 'был', 'была', 'были', 'было', 'быть', 'в', 'вам', 'вас', 'ведь', 'весь',
		'вдоль', 'вместо', 'вне', 'вниз', 'внизу', 'внутри', 'во', 'вокруг', 'вот', 'все', 'всю', 'вся', 'всей',
		'всего', 'всех', 'всем', 'вы', 'где', 'да', 'давай', 'давать', 'даже', 'для', 'до',
		'его', 'ее', 'её', 'если', 'есть', 'еще', 'ещё', 'ей', 'ему', 'ж', 'же', 'за', 'здесь', 'и', 'из',
		'из-за', 'или', 'им', 'их', 'к', 'ка', 'ко', 'как', 'как-то', 'кто', 'когда', 'кроме', 'кто', 'ли', 'нас', 'нам',
		'либо', 'мне', 'меня', 'может', 'мои', 'мою', 'мой', 'моих', 'мной', 'мы', 'на', 'навсегда', 'над', 'надо', 'наш', 'не',
		'него', 'нее', 'неё', 'нет', 'ни', 'ним', 'них', 'но', 'ну', 'о', 'об', 'обо', 'однако', 'он', 'она', 'они', 'оно',
		'от', 'отчего', 'очень', 'ох', 'по', 'под', 'после', 'перед', 'потому', 'потому что', 'почти', 'при',
		'про', 'себя', 'себе', 'свой', 'свою', 'свое', 'своя', 'свой', 'свои', 'своем', 'собой', 'собою', 'снова', 'с', 'со',
		'та', 'так', 'также', 'такие', 'такой', 'там', 'те', 'тем', 'тебе', 'тебя', 'то', 'того', 'таки',
		'тоже', 'той', 'только', 'том', 'тот', 'тут', 'твой', 'твоя', 'твое', 'ты', 'у', 'уж', 'уже', 'ух', 'хотя', 'чего', 'чего-то', 'чей', 'чем',
		'что', 'чтобы', 'чьё', 'чья', 'эта', 'эти', 'этим', 'это', 'этот', 'эту', 'этой', 'этом', 'эх', 'я'
	);

	protected static function cleanText($text) {
		$new_text = preg_replace("/\n|\r|\t|\-/u"," ", $text);
		$new_text = preg_replace("/[^А-Яа-я ]/ui","", $new_text);
		$new_text = preg_replace("/\s+/u"," ", $new_text);
		return mb_strtolower(trim($new_text), 'UTF-8');
	}

	public static function getShingles($text, $n=3) {
		$shingles = array();
		$text = self::cleanText($text);
		$elements = explode(" ",$text);
		$elements = array_diff($elements, self::$stop_words);
		$elements = array_filter($elements, create_function(
            '$word', 'return mb_strlen($word, "UTF-8") > 2;'
		));
		$elements = array_values($elements);
		for ($i=0;$i<(count($elements)-$n+1);$i++) {
			$shingle = array();
			for ($j=0;$j<$n;$j++){
				$shingle[] = $elements[$i+$j];
			}
			$shingles[$i] = join(' ', $shingle);
		}
		return $shingles;    
	}
}
